#include <stdio.h>
main()
{
    int a[10],b[10],i,j,t;
    for ( i=0; i<10; i++ )
        scanf( "%d", &a[i] );
    for ( i=0; i<9; i++ )
        for ( j=0; j<9-i; j++ )
            if ( a[j] < a[j+1] )
            {
                t=a[j]; a[j]=a[j+1]; a[j+1]=t;
            }
    for ( i=0; i<10; i++ )
        b[i] = i+1;
    for ( i=1; i<10; i++ )
        if ( a[i]==a[i-1] )
            b[i] = b[i-1];
    for ( i=0; i<10; i++ )
        printf( "%d:%d ", b[i], a[i] );
    printf( "\n" );
    return 0;
}
/*输入：
     99 100 80 60 70 90 99 70 50 70
则输出：
     1:100 2:99 2:99 4:90 5:80 6:70 6:70 6:70 9:60 10:50
示例说明：第1名为100分，输出“1:100”。99分有2个，都算第2名，第3名空缺。同理，第6名的70分有3个，空缺第7和第8名。  */
