#include <stdio.h>
int main(){
	int a=12,b=10,c,d,e,f,g,h;/*12二进制为1100，10二进制为1010*/ 
	c=a&b;/*&位与：两个相应位全1时结果为1，否则为零*/ /*此处c=1000，对应十进制的8*/ 
	d=a|b;/*|位或：两个相应位全零时结果为0，否则为一*/ /*此处d=1110，对应14*/ 
	e=a^b;/*^位异或：两个相应位相同时结果为零，否则为一*/ /*此处e=0110，对应6*/ 
	f=a<<2;/*<<左移：把左操作数左移指定的位数，右端空位置补零*/ /*f=110000，对应48*/ 
	g=a>>2;                                                     /*g=0011，对应3*/ 
	h=~b;/*取反：把操作数各位0变为1，1变为0*/             
	printf("c=%d\n",c);
	printf("d=%d\n",d);
	printf("e=%d\n",e);
	printf("f=%d\n",f);
	printf("g=%d\n",g);
	printf("h=%d\n",h);
    return 0;
}
